---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DuplicateTypeNamesHandlerArgs Properties
DuplicateTypeNamesHandlerArgs Class See Also Send Feedback
---

The DuplicateTypeNamesHandlerArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Document | The document that contains the types with duplicate names. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DuplicateTypeNamesHandlerArgs Class

Autodesk.Revit.DB Namespace